#+BEGIN: clocktable :emphasize nil :scope file :tags t :compact t
#+CAPTION: Clock summary at [2026-01-04 Sun 12:36]
| Tags    | Headline                                     |  Time |
|---------+----------------------------------------------+-------|
|         | *Total time*                                   | *10:17* |
|---------+----------------------------------------------+-------|
| article | articles                                     |  0:25 |
| article | \_  https://en.wikipedia.org/wiki/COBOL      |  0:25 |
| video   | videos                                       |  9:02 |
| video   | \_  [[https://www.youtube.com/watch?v=csreYlLXMzI&t=139s][Is 2020 the Year of COBOL?  Is a 60...]]   |  1:12 |
| video   | \_  [[https://youtu.be/TBs7HXI76yU][COBOL Tutorial : Learn COBOL in One...]]   |  5:50 |
| video   | \_  [[https://www.youtube.com/watch?v=_pAX_ogguLI][Cobol tutorial for Beginners]]             |  1:00 |
| video   | \_  [[https://www.youtube.com/watch?v=RdMAEdGvtLA][COBOL Course - Programming with VSCode]]   |  1:00 |
| book    | books                                        |  0:50 |
| book    | \_  Structured Cobol Programming by Nancy... |  0:25 |
| book    | \_  COBOL Software Modernization From...     |  0:25 |
#+END:

* language
** code
*** edited pictures: date
#+begin_src cobol
  program-id. hello.
  data division.
  working-storage section.
  01 BDay PIC 9(8) value 01081986.
  01 ADate PIC 99/99/9999.
  procedure division.
  move BDay to ADate
  display ADate    
  stop run.
#+end_src

#+RESULTS:
: 01/08/1986

*** for loop
#+begin_src cobol
  program-id. hello.
      data division.
      working-storage section.
  01 Ind PIC 9(1) value 0.
  procedure division.
  perform ForLoop
          stop run.

  ForLoop.
      perform OutputData varying Ind from 1 by 1
      until Ind=6.
  OutputData.
      display Ind. 
#+end_src

#+RESULTS:
: 1
: 2
: 3
: 4
: 5

*** while
#+begin_src cobol
  program-id. hello.
      data division.
      working-storage section.
  01 Ind PIC 9(1) value 0.
  procedure division.
  perform OutputData with test after until Ind > 5
          stop run.

  OutputData.
      display Ind.
      add 1 to Ind.
#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4
: 5

*** subroutines / linkage
#+begin_src cobol
  program-id. GETSUM.
  data division.
  linkage section.
      01 LNum1 PIC 9 VALUE 5.
      01 LNum2 PIC 9 VALUE 4.
      01 LSum1 PIC 99.
  procedure division using LNum1, LNum2, LSum.
      compute LSum = LNum1 + LNum2.
exit program.
#+end_src

#+begin_src cobol
  program-id. hello.
  data division.
  working-storage section.
      01 Num1 PIC 9 VALUE 5.
      01 Num2 PIC 9 VALUE 4.
      01 Sum1 PIC 99.
  procedure division.
  call 'GETSUM' using Num1, Num2, Sum1.
  display Num1 " + " Num2 " = " Sum1.
exit program.
#+end_src

*** paragraphs
#+begin_src cobol
  program-id. hello.
      data division.
      working-storage section.
  procedure division.
          SubOne.
              display "in paragraph 1"
              perform SubTwo
              perform 2 times
                  display "repeat"
              end-perform
              stop run.
          SubTwo.
              display "in paragraph 2"
              perform SubThree.
          SubThree.
              display "in paragraph 3".
#+end_src

#+RESULTS:
: in paragraph 1
: in paragraph 2
: in paragraph 3
: repeat
: repeat
*** strings: concatanate
#+begin_src cobol
  program-id. hello.
      data division.
      working-storage section.
    01 FirstName PIC X(5) value "Slava".
    01 LastName  PIC X(10) value "Grochowski".
    01 FullName  PIC X(16).
  procedure division.
          string FirstName delimited by size
          space
          LastName delimited by size
          into FullName.
          display FullName.
  stop run.
#+end_src

#+RESULTS:
: Slava Grochowski

*** strings: upper/lower case
#+begin_src cobol
  program-id. hello.
      data division.
      working-storage section.
    01 FirstName PIC X(6) value "Slava".
  procedure division.
          display function upper-case(FirstName)
          display function lower-case(FirstName)
  stop run.
#+end_src

#+RESULTS:
: SLAVA 
: slava 

*** strings: tallying - letters
#+begin_src cobol
  program-id. hello.
      data division.
      working-storage section.
  01 NumAs PIC 99 value 0.
  01 FirstName PIC X(6) value "Slava".
  procedure division.
          inspect FirstName tallying NumAs for all 'a'.
          display "Numer of chars in " FirstName " is " NumAs.
  stop run.
#+end_src

#+RESULTS:
: Numer of chars in Slava  is 02
  
*** strings: tallying
#+begin_src cobol
  program-id. hello.
      data division.
      working-storage section.
  01 NumChars PIC 99 value 0.
  01 FirstName PIC X(6) value "Slava".
  procedure division.
          inspect FirstName tallying NumChars for characters.
          display "Number of chars in " FirstName " is " NumChars.
  stop run.
#+end_src

#+RESULTS:
: Numer of chars in Slava  is 06

- liczba określająca ilość liter w stringu - 6 - imię ma 5
  więc dodaje puste miejsce.
  
*** decimal arithmetic
#+begin_src cobol
  program-id. hello.
      data division.
      working-storage section.
  01 Price PIC 9(3)V99 value 100.
  01 TaxRate PIC V99 value .22.
  01 FullPrice PIC 9(3)V99.
  procedure division.
          compute FullPrice rounded = Price + (Price * TaxRate).
          display "Price + Tax: " FullPrice.
  stop run.
#+end_src

#+RESULTS:
: Price + Tax: 122.00

*** hello COBOL!
#+begin_src cobol
  program-id. hello.
      procedure division.
      display "Hello, COBOL!"
      stop run.
  #+end_src

#+RESULTS:
: Hello, COBOL!

** sections
A COBOL program is split into four divisions: 
 - the identification division
 - the environment division
 - the data division
 - the procedure division
** compile
- cobc -x hello.cob
- ./hello.cob
* dictionary 
** legacy application developer
A legacy application developer maintains, updates, or
modernizes old, outdated software that is still critical to
a business's operations but uses outdated technology or
languages. These developers work with systems that may be
poorly documented, lack community support, and are difficult
to integrate with newer systems, presenting unique technical
and problem-solving challenges. They often need to work with
legacy languages like COBOL and frameworks, and their goal
is to extend the life of these systems, improve performance,
or gradually migrate them to newer technologies.
* articles                                                          :article:
** DONE https://en.wikipedia.org/wiki/COBOL
CLOSED: [2025-10-24 Fri 22:27]
:LOGBOOK:
CLOCK: [2025-10-24 Fri 22:05]--[2025-10-24 Fri 22:30] =>  0:25
- State "DONE"       from              [2025-10-24 Fri 22:30]
:END:
- Several banks have undertaken multi-year COBOL
  modernization efforts, sometimes resulting in widespread
  service disruptions that result in fines.
- newest standard is COBOL 2023
  - A transaction processing facility with COMMIT and ROLLBACK
- As of 2020, COBOL ran background processes 95% of the time a credit or debit card was swiped.
- In 2024, the IRS announced a transition from COBOL to Java
- A COBOL program is split into four divisions: 
  - the identification division
  - the environment division
  - the data division
  - the procedure division
*** Nested statements terminated with a period are a common source of bugs
#+begin_src cobol
IF x
    DISPLAY y.
    DISPLAY z.
#+end_src
Here, the intent is to display y and z if condition x is
true. However, z will be displayed whatever the value of x
because the IF statement is terminated by an erroneous
period after DISPLAY y.
** DONE [[https://www.datacenterknowledge.com/build-design/no-cobol-is-not-a-dead-language][No, COBOL Is Not a Dead Language]]
CLOSED: [2025-09-26 Fri 13:10]
:LOGBOOK:
- State "DONE"       from              [2025-09-26 Fri 13:10]
:END:
** DONE [[https://datagubbe.se/cobol/][A Lasting Legacy: Thoughts on COBOL]]
CLOSED: [2025-09-24 Wed 22:11]
:LOGBOOK:
- State "DONE"       from              [2025-09-24 Wed 22:11]
:END:
** DONE [[https://web.archive.org/web/20160826003417/https://medium.com/@Svenskunganka/interviewing-my-mother-a-mainframe-cobol-programmer-c693d40d88f7#.66qbnhd8p][Interviewing my mother, a mainframe COBOL programmer]]
CLOSED: [2025-09-20 Sat 19:45]
:LOGBOOK:
- State "DONE"       from              [2025-09-20 Sat 19:45]
:END:
** DONE [[https://www.fastcompany.com/91278597/elon-musk-doge-cobol-language][Elon Musk’s DOGE team may need a crash course in COBOL]]
CLOSED: [2025-09-20 Sat 21:04]
:LOGBOOK:
- State "DONE"       from              [2025-09-20 Sat 21:04]
:END:
* videos                                                              :video:
** DONE [[https://youtu.be/p7L8xqKzmP8][The Code that Runs the World]]
CLOSED: [2025-09-17 Wed 10:18]
:LOGBOOK:
- State "DONE"       from              [2025-09-17 Wed 10:18]
:END:
** DONE [[https://www.youtube.com/watch?v=csreYlLXMzI&t=139s][Is 2020 the Year of COBOL?  Is a 60 year old language now the most in-demand programming skill?]]
CLOSED: [2025-09-19 Fri 22:12]
:LOGBOOK:
CLOCK: [2025-09-19 Fri 21:00]--[2025-09-19 Fri 22:12] =>  1:12
- State "DONE"       from              [2025-09-19 Fri 22:12]
:END:
- https://openmainframeproject.org/
- cobol cadets 
- gracehopper.com
- jeff bisti
- masterthemainframe.com
** DONE [[https://youtu.be/TBs7HXI76yU][COBOL Tutorial : Learn COBOL in One Video - Derek Banas]]
CLOSED: [2026-01-04 Sun 12:10] SCHEDULED: <2025-11-17 Mon>
:LOGBOOK:
- State "DONE"       from "TODO"       [2026-01-04 Sun 12:10]
CLOCK: [2026-01-04 Sun 11:45]--[2026-01-04 Sun 12:11] =>  0:25
CLOCK: [2025-11-18 Tue 10:40]--[2025-11-18 Tue 11:05] =>  0:25
CLOCK: [2025-11-18 Tue 10:00]--[2025-11-18 Tue 10:25] =>  0:25
CLOCK: [2025-11-17 Mon 21:13]--[2025-11-17 Mon 21:38] =>  0:25
CLOCK: [2025-11-06 Thu 20:43]--[2025-11-06 Thu 21:08] =>  0:25
CLOCK: [2025-10-24 Fri 20:51]--[2025-10-24 Fri 21:16] =>  0:25
CLOCK: [2025-10-18 Sat 20:48]--[2025-10-18 Sat 21:13] =>  0:25
CLOCK: [2025-10-18 Sat 19:52]--[2025-10-18 Sat 20:17] =>  0:25
CLOCK: [2025-10-18 Sat 18:51]--[2025-10-18 Sat 19:16] =>  0:25
CLOCK: [2025-10-16 Thu 12:33]--[2025-10-16 Thu 12:58] =>  0:25
CLOCK: [2025-09-27 Sat 13:03]--[2025-09-27 Sat 13:28] =>  0:25
CLOCK: [2025-09-26 Fri 19:41]--[2025-09-26 Fri 20:06] =>  0:25
CLOCK: [2025-09-26 Fri 15:03]--[2025-09-26 Fri 15:27] =>  0:25
CLOCK: [2025-09-26 Fri 12:38]--[2025-09-26 Fri 13:03] =>  0:25
:END:
** TODO [[https://www.youtube.com/watch?v=_pAX_ogguLI][Cobol tutorial for Beginners]]
:LOGBOOK:
CLOCK: [2025-12-20 Sat 12:34]--[2025-12-20 Sat 13:34] =>  1:00
:END:
** TODO [[https://www.youtube.com/watch?v=RdMAEdGvtLA][COBOL Course - Programming with VSCode]]
:LOGBOOK:
CLOCK: [2025-12-21 Sun 12:03]--[2025-12-21 Sun 13:03] =>  1:00
:END:
- jeff bisti
** TODO [[https://www.youtube.com/watch?v=XbRNDcGFrOM&list=PLdG1SnrYXH0EmUqQWol39Fd6VHcr-FbwS][Bill Sky - The Computer Guy!]]
* links
** [[https://www.youtube.com/playlist?list=PLfg9ycqfY2SX19hFRfuALDcpe6OdNVobX][Mainframe]]
** https://www.mainframestechhelp.com/tutorials/cobol/
* books                                                                :book:
** Structured Cobol Programming by Nancy & Robert Stern - 1988
:LOGBOOK:
CLOCK: [2025-10-24 Fri 21:35]--[2025-10-24 Fri 22:00] =>  0:25
:END:
** COBOL Software Modernization From Principles to Implementation with BLU AGE Method - Barbier, Franck; Recoussine, Jean-Luc (London England), 1, 2015
:LOGBOOK:
CLOCK: [2025-10-25 Sat 10:00]--[2025-10-25 Sat 10:25] =>  0:25
:END:
